<template>
  <div class="container-fluid">
    <div class="talk">
      <span>{{ this.talks[idx1][idx2] }}</span>
    </div>
  </div>
</template>

<script>
import api from "../../utils/api";
export default {
  data() {
    return {
      name: "",
      idx1: 0,
      idx2: 0,
      talks: [
        [
          "投資不熟悉的產業或企業，勝算通常不高 －彼得林區",
          "投資的世界，情緒是敵人，理性才是我們的朋友",
          "要在別人貪婪的時候恐懼，在別人恐懼的時候貪婪 －巴菲特",
          "省小錢靠記帳，賺大錢靠投資。",
          "沒有存不了錢的人，只有不會管錢的人。",
        ],

        [
          "想要賺錢，就要找別人不懂的，或做那些想法僵硬的人不肯做的事 －彼得林區",
          "我喜歡簡單的東西 －巴菲特",
          "目標，有可能是別人的；而夢想，絕對都是自己的。",
          "有錢能省直須省，莫待無錢餓肚子。",
          "追求資本大幅成長的投資人，應淡化股利的重要性 －菲利浦費雪",
          "投資不熟悉的產業或企業，勝算通常不高 －彼得林區",
          "投資的世界，情緒是敵人，理性才是我們的朋友",
          "要在別人貪婪的時候恐懼，在別人恐懼的時候貪婪 －巴菲特",
          "省小錢靠記帳，賺大錢靠投資。",
          "沒有存不了錢的人，只有不會管錢的人。",
        ],

        [
          "投資 不是賭博，而是一種不斷用來認識自己、了解社會運作的工具",
          "獲利只會跟未來的價格有關係，跟持有的成本沒有關係",
          "留財不留富，早晚財變負。",
          "花錢買享受，高興一下子；花錢買消災，心痛一陣子；花錢買資產，幸福一輩子。",
          "練習沒有休止符，個性可以不服輸，但操作要勇於認輸。不遵守紀律，市場會修理你。 －林恩如",
          "想要賺錢，就要找別人不懂的，或做那些想法僵硬的人不肯做的事 －彼得林區",
          "我喜歡簡單的東西 －巴菲特",
          "目標，有可能是別人的；而夢想，絕對都是自己的。",
          "有錢能省直須省，莫待無錢餓肚子。",
          "追求資本大幅成長的投資人，應淡化股利的重要性 －菲利浦費雪",
          "投資不熟悉的產業或企業，勝算通常不高 －彼得林區",
          "投資的世界，情緒是敵人，理性才是我們的朋友",
          "要在別人貪婪的時候恐懼，在別人恐懼的時候貪婪 －巴菲特",
          "省小錢靠記帳，賺大錢靠投資。",
          "沒有存不了錢的人，只有不會管錢的人。",
        ],

        [
          "投資，不只是輸贏，而是一種培養深刻洞察力的訓練。",
          "節儉可以幫助我們渡過未來的難關以及多存一點錢投資",
          "投資，不是看結果，而是一種過程，一種 從恐懼無知 到怡然自得的過程。",
          "存錢，是為了走更遠的路。理財，是讓路變得好走。",
          "投資理財就像打高爾夫球，一桿進洞總是令人陶醉，不過最後的勝利者仍是那些用最少桿數，一桿又一桿穩定把球推進18個洞裡的人。",
          "股市要求堅定的信心，沒有信心者必將滅亡",
        ],

        [
          "只有退潮時，你才知道是誰在裸體游泳 －巴菲特",
          "假如你是那種會在慌亂中拋售一切的人，你就該遠離股票市場 －彼得林區",
          "投資，不是買賣，而是一種不斷把自己的洞見，推展到極致的方法。",
          "平時不理財，老年沒財理。",
          "存錢不存利，賺錢只好靠勞力。生財又生息，日後就能常休息。",
          "投資，不只是輸贏，而是一種培養深刻洞察力的訓練。",
          "節儉可以幫助我們渡過未來的難關以及多存一點錢投資",
          "投資，不是看結果，而是一種過程，一種 從恐懼無知 到怡然自得的過程。",
          "存錢，是為了走更遠的路。理財，是讓路變得好走。",
          "投資理財就像打高爾夫球，一桿進洞總是令人陶醉，不過最後的勝利者仍是那些用最少桿數，一桿又一桿穩定把球推進18個洞裡的人。",
          "股市要求堅定的信心，沒有信心者必將滅亡",
        ],

        [
          "不要隨群眾起舞 －菲利浦費雪",
          "越早開始理財越好。",
          "投資既有趣又刺激，但若不下苦功，就可能有危險 －彼得林區",
          "賺錢要努力，花錢別用力，存錢需毅力，投資務必靠腦力。",
          "很多人會說，我沒有錢怎麼理財；其實這句話的意思是，我沒有存錢的習慣。",
          "只有退潮時，你才知道是誰在裸體游泳 －巴菲特",
          "假如你是那種會在慌亂中拋售一切的人，你就該遠離股票市場 －彼得林區",
          "投資，不是買賣，而是一種不斷把自己的洞見，推展到極致的方法。",
          "平時不理財，老年沒財理。",
          "存錢不存利，賺錢只好靠勞力。生財又生息，日後就能常休息。",
          "投資，不只是輸贏，而是一種培養深刻洞察力的訓練。",
          "節儉可以幫助我們渡過未來的難關以及多存一點錢投資",
          "投資，不是看結果，而是一種過程，一種 從恐懼無知 到怡然自得的過程。",
          "存錢，是為了走更遠的路。理財，是讓路變得好走。",
          "投資理財就像打高爾夫球，一桿進洞總是令人陶醉，不過最後的勝利者仍是那些用最少桿數，一桿又一桿穩定把球推進18個洞裡的人。",
          "股市要求堅定的信心，沒有信心者必將滅亡",
        ],

        [
          "擁有一隻股票，期待它明天早上晨就上漲是十分愚蠢的。 －巴菲特",
          "你不會因為不屬於你的東西價格上漲而受害，你所擁有的東西才會毀了你。 －彼得林區",
          "你不需要成為有錢人才能理財，但你需要理財才能成為有錢人。",
          "靠老闆加薪去理財，不如靠自己理財來加薪。",
          "金錢與時間都是人一生重要的資產。前者從無到有可以靠自己，趁早管理；後者從有到無只能看老天，好好珍惜！",
        ],

        [
          "學習，永遠要擺在賺錢的前面；先接受自己無知，然後才開始投資。",
          "理財是種計畫不是危機管理，要在錢進來之前就先管理它。",
          "理財就像慢跑，你可以規劃最佳路線，身穿最新的運動衣，腳踩最耐磨的鞋子，但只要沒有開始行動，就永遠不會通過終點。",
          "珍惜你的每一筆收入，因為那是實現夢想的重要工具。",
          "一個人會成功，是因不放棄做簡單的事。",
          "擁有一隻股票，期待它明天早上晨就上漲是十分愚蠢的。 －巴菲特",
          "你不會因為不屬於你的東西價格上漲而受害，你所擁有的東西才會毀了你。 －彼得林區",
          "你不需要成為有錢人才能理財，但你需要理財才能成為有錢人。",
          "靠老闆加薪去理財，不如靠自己理財來加薪。",
          "金錢與時間都是人一生重要的資產。前者從無到有可以靠自己，趁早管理；後者從有到無只能看老天，好好珍惜！",
        ],

        [
          "存股最難的並非能存多少，而是你會存多久，還有何時開始。",
          "現在先照顧好金錢，未來金錢就會照顧好你。",
          "幸福人生不是計較出來的，是計畫出來的。",
          "不要把你的現況跟未來畫上等號，只要努力，未來一定會比現在還好。",
          "不是行頭看起來很有錢，就代表戶頭也會很有錢。",
          "學習，永遠要擺在賺錢的前面；先接受自己無知，然後才開始投資。",
          "理財是種計畫不是危機管理，要在錢進來之前就先管理它。",
          "理財就像慢跑，你可以規劃最佳路線，身穿最新的運動衣，腳踩最耐磨的鞋子，但只要沒有開始行動，就永遠不會通過終點。",
          "珍惜你的每一筆收入，因為那是實現夢想的重要工具。",
          "一個人會成功，是因不放棄做簡單的事。",
          "擁有一隻股票，期待它明天早上晨就上漲是十分愚蠢的。 －巴菲特",
          "你不會因為不屬於你的東西價格上漲而受害，你所擁有的東西才會毀了你。 －彼得林區",
          "你不需要成為有錢人才能理財，但你需要理財才能成為有錢人。",
          "靠老闆加薪去理財，不如靠自己理財來加薪。",
          "金錢與時間都是人一生重要的資產。前者從無到有可以靠自己，趁早管理；後者從有到無只能看老天，好好珍惜！",
        ],
      ],
    };
  },
  methods: {
    change() {
      if (this.name == "綠觸蛋") {
        this.idx1 = 0;
        this.idx2 = parseInt(Math.random() * 6);
      } else if (this.name == "花椰菜") {
        this.idx1 = 1;
        this.idx2 = parseInt(Math.random() * 11);
      } else if (this.name == "三株花椰龍") {
        this.idx1 = 2;
        this.idx2 = parseInt(Math.random() * 16);
      } else if (this.name == "橘草蛋") {
        this.idx1 = 3;
        this.idx2 = parseInt(Math.random() * 6);
      } else if (this.name == "函吉") {
        this.idx1 = 4;
        this.idx2 = parseInt(Math.random() * 11);
      } else if (this.name == "巨橘袋鼠") {
        this.idx1 = 5;
        this.idx2 = parseInt(Math.random() * 16);
      } else if (this.name == "嗨啾方蛋") {
        this.idx1 = 6;
        this.idx2 = parseInt(Math.random() * 6);
      } else if (this.name == "嗨揪") {
        this.idx1 = 7;
        this.idx2 = parseInt(Math.random() * 11);
      } else if (this.name == "長頸貓") {
        this.idx1 = 8;
        this.idx2 = parseInt(Math.random() * 16);
      }
    },
  },
  mounted() {
    api
      .userfocusmonster()
      .then((res) => {
        // console.log(res.data);
        this.name = res.data.message.monster.name;
        if (this.name == "綠觸蛋") {
          this.idx1 = 0;
          this.idx2 = parseInt(Math.random() * 6);
        } else if (this.name == "花椰菜") {
          this.idx1 = 1;
          this.idx2 = parseInt(Math.random() * 11);
        } else if (this.name == "三株花椰龍") {
          this.idx1 = 2;
          this.idx2 = parseInt(Math.random() * 16);
        } else if (this.name == "橘草蛋") {
          this.idx1 = 3;
          this.idx2 = parseInt(Math.random() * 6);
        } else if (this.name == "函吉") {
          this.idx1 = 4;
          this.idx2 = parseInt(Math.random() * 11);
        } else if (this.name == "巨橘袋鼠") {
          this.idx1 = 5;
          this.idx2 = parseInt(Math.random() * 16);
        } else if (this.name == "嗨啾方蛋") {
          this.idx1 = 6;
          this.idx2 = parseInt(Math.random() * 6);
        } else if (this.name == "嗨揪") {
          this.idx1 = 7;
          this.idx2 = parseInt(Math.random() * 11);
        } else if (this.name == "長頸貓") {
          this.idx1 = 8;
          this.idx2 = parseInt(Math.random() * 16);
        }
      })
      .catch(function(error) {
        console.log("請求失敗", error);
      });
  },
};
</script>

<style src="./style.css" scoped></style>
